Table of Contents
 Class IdeaCombiItem
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaCombiItem : AbstractIdeaObject<IIdeaCombiItem>, IEquatable<AbstractIdeaObject<IIdeaCombiItem>>, IIdeaCombiItem, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaCombiItem>
IdeaCombiItem
Implements
IEquatable<AbstractIdeaObject<IIdeaCombiItem>>
IIdeaCombiItem
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaCombiItem>.Id
 AbstractIdeaObject<IIdeaCombiItem>.Name
 AbstractIdeaObject<IIdeaCombiItem>.Identifier
 AbstractIdeaObject<IIdeaCombiItem>.GetHashCode()
 AbstractIdeaObject<IIdeaCombiItem>.Equals(object)
 AbstractIdeaObject<IIdeaCombiItem>.Equals(AbstractIdeaObject<IIdeaCombiItem>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaCombiItem(Identifier<IIdeaCombiItem>)
public IdeaCombiItem(Identifier<IIdeaCombiItem> identifer)
Parameters
identifer Identifier<IIdeaCombiItem>
 IdeaCombiItem(int)
public IdeaCombiItem(int id)
Parameters
id int
 IdeaCombiItem(string)
public IdeaCombiItem(string id)
Parameters
id string
Properties
 Coeff
Coefficient
public virtual double Coeff { get; set; }
Property Value
double
 Combination
Inserted another combination
public virtual IIdeaCombiInput Combination { get; set; }
Property Value
IIdeaCombiInput
 LoadCase
public virtual IIdeaLoadCase LoadCase { get; set; }
Property Value
IIdeaLoadCase
 Edit this page